IDENTIFICATION DIVISION.
PROGRAM-ID. ARITHM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-A      PIC 9(3) VALUE 25.
01 NUM-B      PIC 9(3) VALUE 4.
01 RESULT     PIC 9(5) VALUE 0.
01 REMAINDER-V PIC 9(3) VALUE 0.

PROCEDURE DIVISION.
    ADD NUM-A TO NUM-B GIVING RESULT.
    DISPLAY "ADD       : " RESULT.

    SUBTRACT NUM-B FROM NUM-A GIVING RESULT.
    DISPLAY "SUBTRACT  : " RESULT.

    MULTIPLY NUM-A BY NUM-B GIVING RESULT.
    DISPLAY "MULTIPLY  : " RESULT.

    DIVIDE NUM-A BY NUM-B GIVING RESULT
        REMAINDER REMAINDER-V.
    DISPLAY "DIVIDE    : " RESULT
        " REMAINDER " REMAINDER-V.

    STOP RUN.
