LOGICAL: PROCEDURE OPTIONS(MAIN);
   DCL AGE    FIXED BINARY(31);
   DCL HAS_ID BIT(1);

   AGE = 25;
   HAS_ID = '1'B;

   PUT EDIT('AGE = 25, HAS_ID = TRUE')(A);

   IF AGE >= 18 & HAS_ID THEN
      PUT SKIP EDIT('AGE >= 18 AND HAS_ID : ENTRY ALLOWED')(A);
   ELSE
      PUT SKIP EDIT('AGE >= 18 AND HAS_ID : ENTRY DENIED')(A);

   IF AGE < 13 | AGE > 65 THEN
      PUT SKIP EDIT('AGE < 13 OR AGE > 65 : DISCOUNT')(A);
   ELSE
      PUT SKIP EDIT('AGE < 13 OR AGE > 65 : NO DISCOUNT')(A);

   IF ^ HAS_ID THEN
      PUT SKIP EDIT('NOT HAS_ID : MISSING ID')(A);
   ELSE
      PUT SKIP EDIT('NOT HAS_ID : ID PRESENT')(A);
END LOGICAL;
