/* Arithmetic operators in REXX */
say 7 + 3      /* Addition:        10   */
say 7 - 3      /* Subtraction:      4   */
say 7 * 3      /* Multiplication:  21   */
say 7 / 2      /* Division:         3.5 */
say 7 % 2      /* Integer divide:   3   */
say 7 // 2     /* Remainder:        1   */
say 2 ** 10    /* Power:         1024   */
say -5 + 2     /* Prefix minus:    -3   */
