IDENTIFICATION DIVISION.
PROGRAM-ID. MAINSQ.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-VALUE     PIC 9(2) VALUE 12.
01 WS-SQUARE    PIC 9(3) VALUE 0.

PROCEDURE DIVISION.
    DISPLAY "Calling the SQUARE subprogram...".
    CALL "SQUARE" USING WS-VALUE WS-SQUARE.
    DISPLAY WS-VALUE " squared is " WS-SQUARE.
    STOP RUN.
