IDENTIFICATION DIVISION.
PROGRAM-ID. RECURSE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-N        PIC 9 VALUE 5.
01 WS-RESULT   PIC 9(3) VALUE 0.

PROCEDURE DIVISION.
    CALL "FACT" USING WS-N WS-RESULT.
    DISPLAY WS-N "! = " WS-RESULT.
    STOP RUN.

END PROGRAM RECURSE.

IDENTIFICATION DIVISION.
PROGRAM-ID. FACT IS RECURSIVE.

DATA DIVISION.
LOCAL-STORAGE SECTION.
01 LS-PREV     PIC 9.

LINKAGE SECTION.
01 LK-N        PIC 9.
01 LK-RESULT   PIC 9(3).

PROCEDURE DIVISION USING LK-N LK-RESULT.
    IF LK-N <= 1
        MOVE 1 TO LK-RESULT
    ELSE
        SUBTRACT 1 FROM LK-N GIVING LS-PREV
        CALL "FACT" USING LS-PREV LK-RESULT
        MULTIPLY LK-N BY LK-RESULT
    END-IF
    GOBACK.

END PROGRAM FACT.
