IDENTIFICATION DIVISION.
PROGRAM-ID. SQUARE.

DATA DIVISION.
LINKAGE SECTION.
01 LK-INPUT     PIC 9(2).
01 LK-RESULT    PIC 9(3).

PROCEDURE DIVISION USING LK-INPUT LK-RESULT.
    COMPUTE LK-RESULT = LK-INPUT * LK-INPUT.
    GOBACK.
