TABLE: PROCEDURE OPTIONS(MAIN);

   DECLARE NAME  CHARACTER(8) VARYING;
   DECLARE SCORE FIXED DECIMAL(3);

   NAME = 'Alice'; SCORE = 95;
   PUT EDIT(NAME, SCORE) (A(8), X(3), F(5));

   NAME = 'Bob';   SCORE = 82;
   PUT SKIP EDIT(NAME, SCORE) (A(8), X(3), F(5));

END TABLE;
