FACT: PROCEDURE OPTIONS(MAIN);

   DECLARE N FIXED BINARY(31);

   DO N = 1 TO 6;
      PUT SKIP EDIT(N, '! = ', FACTORIAL(N)) (F(1), A, F(3));
   END;

   /* RECURSIVE lets the function call itself safely */
   FACTORIAL: PROCEDURE(N) RETURNS(FIXED BINARY(31)) RECURSIVE;
      DECLARE N FIXED BINARY(31);
      IF N <= 1 THEN
         RETURN(1);
      ELSE
         RETURN(N * FACTORIAL(N - 1));
   END FACTORIAL;

END FACT;
